{
    "games" : [
               {
               "title" : "CS:GO",
               "shortDescription" : "Counter-Strike: Global Offensive (abbreviated as CS:GO) is a multiplayer first- person shooter video ",
               "fullDescription" : "Counter-Strike: Global Offensive (abbreviated as CS:GO) is a multiplayer first- person shooter video . Counter-Strike: Global Offensive (abbreviated as CS:GO) is a multiplayer first- person shooter video . Counter-Strike: Global Offensive (abbreviated as CS:GO) is a multiplayer first- person shooter video ",
               "url" :  "google.com",
               "image" : "csgo",
               },
               {
               "title" : "Rust",
               "shortDescription" : "Rust — многопользовательская компьютерная игра в жанре симулятора выживания, была создана независимой британской студией Facepunch[1] во главе которой с 2014 года состоит Гарри Ньюмэн. Выпуск игры состоялся 8 февраля 2018 года.",
               "fullDescription" : "В 2014 году разрабатываемая игра была переведена на новый игровой движок. Версия на старом движке стала именоваться Legacy, а новая получила название Experimental. 6 октября 2016 года из клиентской части игры была удалена возможность запуска версии Legacy. Новая версия игры глубоко отличается от Legacy, во многом благодаря новой версии движка Unity. Также, в новой версии была изменена система строительства — проработана система гниения построек и добавлен показатель устойчивости, что не позволит игрокам строить огромные «замки до небес». К тому же добавлены двойные двери, люки, лестницы и ограждения. Большинство предметов, которые были в Legacy, также перенесены на новую версию, но многие из них были изменены. В новой версии появилось больше видов различного снаряжения. На многих серверах карта является процедурно-генерируемой. Это означает, что в игре отсутствует единая игровая карта для всех серверов. Система чертежей, как в Legacy, вносила в игру элемент high-end контента. Были доступны базовые предметы для крафта, но для более серьезных вещей требовались чертежи. В июле 2016 года была внедрена система опыта. От старой системы чертежей пришлось отказаться, но разработчики оставили возможность вернуться на версию с ней. Игра стала больше похожа на симулятор выживания с элементами классической RPG. Игрок получает опыт и уровень, и может открывать новые предметы для крафта. В ноябре 2016 года система опыта была заменена на систему компонентов. Игрокам стал доступен крафт всех вещей, но для некоторых предметов необходимы детали — компоненты. В 2017 году появилась система компоненты плюс чертежи.",
               "url" :  "https://ru.wikipedia.org/wiki/Rust_(игра)",
               "image" : "rust",
               },
               
               ]
}
