{
  "games" : [
    {
      "title" : "CS:GO",
      "releaseDate" : "2015",
      "shortDescription" : "Counter-Strike: Global Offensive (CS:GO; с англ. — «Контрудар: глобальное наступление») — многопользовательская компьютерная игра, разработанная компаниями Valve и Hidden Path Entertainment. Последняя основная игра в серии игр Counter-Strike; как и все игры серии, она посвящена противостоянию террористов и подразделений специального назначения.",
      "fullDescription" : "Counter-Strike: Global Offensive (CS:GO; с англ. — «Контрудар: глобальное наступление») — многопользовательская компьютерная игра, разработанная компаниями Valve и Hidden Path Entertainment. Последняя основная игра в серии игр Counter-Strike; как и все игры серии, она посвящена противостоянию террористов и подразделений специального назначения. Первые новости о разработке игры появились вместе с официальным анонсом — 12 августа 2011 года. Слухи о том, что компания Valve, ответственная за серию игр Counter-Strike, разрабатывает новую часть игры (последней на тот момент основной игрой серии, не считая отдельной версии, направленной на азиатскую аудиторию, была Counter-Strike: Source 2004 года) распространились несколькими днями ранее[4][5]. В анонсе игры сообщалось о том, что разработчики обещают сохранить основы игрового процесса «классической» версии игры — Counter-Strike 1.6, а также добавить новые карты для многопользовательских сражений (среди которых будут ремейки старых карт с улучшенной графикой), модели бойцов и оружие. В числе прочих усовершенствований ожидались онлайн-таблицы рекордов и система автоматического подбора соперников. Говорилось о том, что игра выйдет в начале 2012 года, а в 2011 году она будет продемонстрирована на выставках PAX Prime и Eurogamer Expo. Игра разрабатывалась для персонального компьютера с операционными системами Windows и Mac OS X, и для игровых консолей PlayStation 3 и Xbox 360 (там она вышла в онлайн-сервисах PlayStation Network и Xbox Live соответственно). Некоторые сайты предположили, что Counter-Strike: Global Offensive будет базироваться на последней версии игрового движка Source, собственной разработки Valve, на которой построены все последние игры студии; однако в официальном анонсе нет никаких уточнений, касающихся технологической части[6][7][8][9][10][11]. Несколько крупных сайтов опубликовали «трейлер игры», который на самом деле является перемонтированным любителем (в частности, изменена надпись в конце ролика) трейлером другой части, Counter-Strike Online.",
      "url" :  "https://ru.wikipedia.org/wiki/Counter-Strike:_Global_Offensive",
      "image" : "csgo",
      "fullImage" : "csgo_full"
    },
    {
      "title" : "Rust",
      "releaseDate" : "2018",
      "shortDescription" : "Rust — многопользовательская компьютерная игра в жанре симулятора выживания, была создана независимой британской студией Facepunch[1] во главе которой с 2014 года состоит Гарри Ньюмэн. Выпуск игры состоялся 8 февраля 2018 года.",
      "fullDescription" : "В 2014 году разрабатываемая игра была переведена на новый игровой движок. Версия на старом движке стала именоваться Legacy, а новая получила название Experimental. 6 октября 2016 года из клиентской части игры была удалена возможность запуска версии Legacy. Новая версия игры глубоко отличается от Legacy, во многом благодаря новой версии движка Unity. Также, в новой версии была изменена система строительства — проработана система гниения построек и добавлен показатель устойчивости, что не позволит игрокам строить огромные «замки до небес». К тому же добавлены двойные двери, люки, лестницы и ограждения. Большинство предметов, которые были в Legacy, также перенесены на новую версию, но многие из них были изменены. В новой версии появилось больше видов различного снаряжения. На многих серверах карта является процедурно-генерируемой. Это означает, что в игре отсутствует единая игровая карта для всех серверов. Система чертежей, как в Legacy, вносила в игру элемент high-end контента. Были доступны базовые предметы для крафта, но для более серьезных вещей требовались чертежи. В июле 2016 года была внедрена система опыта. От старой системы чертежей пришлось отказаться, но разработчики оставили возможность вернуться на версию с ней. Игра стала больше похожа на симулятор выживания с элементами классической RPG. Игрок получает опыт и уровень, и может открывать новые предметы для крафта. В ноябре 2016 года система опыта была заменена на систему компонентов. Игрокам стал доступен крафт всех вещей, но для некоторых предметов необходимы детали — компоненты. В 2017 году появилась система компоненты плюс чертежи.",
      "url" :  "https://en.wikipedia.org/wiki/Rust_(video_game)",
      "image" : "rust",
      "fullImage" : "rust_full"
    },
    {
      "title" : "Battlefield 3",
      "releaseDate" : "2011",
      "shortDescription" : "Battlefield 3 (с англ. — «Поле битвы 3») — компьютерная игра в жанре шутера от первого лица, разработанная студией EA Digital Illusions CE и изданная компанией Electronic Arts; одиннадцатая в серии Battlefield. Релиз игры для платформ ПК (ОС Windows Vista и Windows 7), PlayStation 3 и Xbox 360 состоялся в октябре 2011 года. Battlefield 3 — прямой сиквел к Battlefield 2, вышедшей в 2005 году.",
      "fullDescription" : "В интервью журналу Игромания главный разработчик игры Патрик Бах пояснил появление сюжетной кампании изменившейся обстановкой на рынке компьютерных игр. Согласно его утверждению, игры, вообще не имеющие кампании, теперь продаются хуже, нежели раньше[4]. Американский морпех, Генри Блэкбэрн, на допросе в ЦРУ рассказывает агентам о человеке по имени Соломон и угрозе, которую он представляет для США. Ему обещают помочь, но Блэкбэрн должен сказать, откуда он знает о Соломоне. История начинается в Ираке. Отряд Блэкбэрна получает приказ найти пропавший американский патруль в одном из районов небольшого городка в Сулеймании. Операция из поисковой превращается в боевую, когда отряд Блэкбэрна сталкивается с вооружёнными бойцами из иранской военной организации PLR (в русской версии игры — ССО). В одного из морских пехотинцев попадает снайпер, однако Блэку удается вытащить товарища с линии огня. После того, как морпехи уничтожают противника, раненого эвакуируют. Отряд Блэка находит пропавших солдат и запрашивают поддержку, в это время повстанцы переходят в наступление, однако им не удается продвинуться к рынку, морпехи начинают одерживать верх. В это время начинается сильнейшее землетрясение, которое практически полностью разрушает часть города и приводит к гибели множества людей. Блэкбэрн выживает. К месту катастрофы прибывают многочисленные отряды ССО, однако Блэку удается пробиться к точке эвакуации и покинуть опасную область. В день, когда произошло землетрясение, власть в Иране захватывает Фарук Аль-Башир, лидер ССО. Американское командование начинает военную операцию в Иране, цель которой — устранение диктатора.",
      "url" : "https://ru.wikipedia.org/wiki/Battlefield_3",
      "image" : "bf3",
      "fullImage" : "bf3_full"
    },
    {
      "title" : "Call of Duty",
      "releaseDate" : "2004",
      "shortDescription" : "Call of Duty (с англ. — «служебный долг», «зов долга») — серия компьютерных игр в жанре шутера от первого лица, посвящённых Второй мировой войне, холодной войне, борьбе с терроризмом и гипотетической Третьей мировой войне. Серия состоит из четырнадцати основных игр и десяти ответвлений. Изначально серия создавалась для персональных компьютеров, позже она стала также выпускаться на игровых консолях и портативных устройствах. Игры серии Call of Duty издаются компаниями Activision и Aspyr Media. Основные игры серии создаются компаниями Infinity Ward (используются модификации движка id Tech 3 и собственные разработки) и Treyarch (используется собственный движок — Treyarch NGL). В создании прочих версий и изданий игры в различное время участвовали Gray Matter Interactive, Spark Unlimited, Pi Studios, Amaze Entertainment, Rebellion Developments, Sledgehammer Games, Raven Software, n-Space, Neversoft и The Blast Furnace с применением большого числа различных технологий.",
      "fullDescription" : "Call of Duty (с англ. — «служебный долг», «зов долга») — серия компьютерных игр в жанре шутера от первого лица, посвящённых Второй мировой войне, холодной войне, борьбе с терроризмом и гипотетической Третьей мировой войне. Серия состоит из четырнадцати основных игр и десяти ответвлений. Изначально серия создавалась для персональных компьютеров, позже она стала также выпускаться на игровых консолях и портативных устройствах. Игры серии Call of Duty издаются компаниями Activision и Aspyr Media. Основные игры серии создаются компаниями Infinity Ward (используются модификации движка id Tech 3 и собственные разработки) и Treyarch (используется собственный движок — Treyarch NGL). В создании прочих версий и изданий игры в различное время участвовали Gray Matter Interactive, Spark Unlimited, Pi Studios, Amaze Entertainment, Rebellion Developments, Sledgehammer Games, Raven Software, n-Space, Neversoft и The Blast Furnace с применением большого числа различных технологий. Во второй половине 2012 года появилась информация о том, что игры серии Call of Duty появятся и на мобильных устройствах: мобильные телефоны, планшеты[1], вероятность подобного события повысилась при официальном заявлении Activision о своём плане развивать свои самые успешные игры и серии игр на мобильных устройствах[2], отдельно о том, что изучается возможность создания игр серии Call of Duty для мобильных устройств, повторно подчеркнуто представителем Activision в конце апреля 2013 года[3]. Первая игра для мобильных устройств — Call of Duty: Strike Team[4] — вышла 6 сентября 2013 года. Начиная с 2014 года разработка игр серии перешла на трёхлетний цикл, к списку основных студий (Infinity Ward и Treyarch), разрабатывающих игры серии, добавилась Sledgehammer Games[5][6].",
      "url" :  "https://ru.wikipedia.org/wiki/Call_of_Duty_4:_Modern_Warfare",
      "image" : "callofduty",
      "fullImage" : "cod_full"
    },
    {
      "title" : "Counter-Strike",
      "releaseDate" : "2000",
      "shortDescription" : "Counter-Strike (с англ. — «Контрудар»; сокр. CS или КС) — серия компьютерных игр в жанре командного шутера от первого лица, основанная на движке GoldSrc, изначально появившаяся как модификация игры Half-Life. Всего в основной серии вышло пять версий игры, самая популярная из которых — Counter-Strike 1.6. Существуют и отдельные части, например Counter-Strike: Condition Zero (мультиплеер с одиночными заданиями) и Condition Zero: Deleted Scenes (сюжетная игра), основанные на движке GoldSource, а также Counter-Strike: Source, основанная на более современном движке Source. 14 августа 2011 года Valve официально презентовала Counter-Strike: Global Offensive, которая вышла 21 августа 2012 года[12].",
      "fullDescription" : "Counter-Strike (с англ. — «Контрудар»; сокр. CS или КС) — серия компьютерных игр в жанре командного шутера от первого лица, основанная на движке GoldSrc, изначально появившаяся как модификация игры Half-Life. Всего в основной серии вышло пять версий игры, самая популярная из которых — Counter-Strike 1.6. Существуют и отдельные части, например Counter-Strike: Condition Zero (мультиплеер с одиночными заданиями) и Condition Zero: Deleted Scenes (сюжетная игра), основанные на движке GoldSource, а также Counter-Strike: Source, основанная на более современном движке Source. 14 августа 2011 года Valve официально презентовала Counter-Strike: Global Offensive, которая вышла 21 августа 2012 года[12]. Counter-Strike — популярная[13] многопользовательская игра, имеющая поддержку сетевых и одиночных игр (с ботами). Некоторые аналитики считают, что в настоящее время Counter-Strike 1.6 теряет популярность по мере появления у игроков более мощных ПК, поддерживающих современные игры с более красивой графикой и усовершенствованными физическими движками[14][15]. В 2007—2008 гг. наметился обратный процесс — укрепления позиций CS 1.6 как турнирной дисциплины[16][17]. Множество людей по всему миру не спешат покинуть ряды виртуальных бойцов Counter-Strike. Прежде всего это связано со ставшим привычным геймплеем. Основная идея игры — противостояние двух команд — террористов (Terrorist forces, T) и контр-террористов (Counter-Terrorist forces, CT; в русской локализации Global Offensive — спецназ). Каждый игрок при входе в игру выбирает команду, за которую он хочет играть, либо возможность быть наблюдателем (Spectator), если это предусмотрено настройками игрового сервера. Цель игры — выполнить задание карты или уничтожить противников. За выполненные задания и уничтоженных противников игрок получает деньги, которые может потратить на покупку оружия (проигравшая команда также получает деньги, но существенно меньше).",
      "url" :  "https://ru.wikipedia.org/wiki/Counter-Strike",
      "image" : "cs",
      "fullImage" : "cs_full"
    },
    {
      "title" : "Day of Defeat",
      "releaseDate" : "2003",
      "shortDescription" : "Day of Defeat (DoD, англ. День поражения, предположительно по аналогии с «Днём Победы») — популярная модификация Half-Life, представляющая собой сетевой командный шутер от первого лица, действия которого разворачиваются в Европе[1] времён Второй мировой войны. Источником вдохновения авторов при создании игры послужил видеофильм Спасти рядового Райана. В более поздних версиях модификации даже были использованы звуковые эффекты из этого фильма. События игры разворачиваются во времена WW2.",
      "fullDescription" : "Day of Defeat (DoD, англ. День поражения, предположительно по аналогии с «Днём Победы») — популярная модификация Half-Life, представляющая собой сетевой командный шутер от первого лица, действия которого разворачиваются в Европе[1] времён Второй мировой войны. Источником вдохновения авторов при создании игры послужил видеофильм Спасти рядового Райана. В более поздних версиях модификации даже были использованы звуковые эффекты из этого фильма. События игры разворачиваются во времена WW2. Проект Day of Defeat зародился в 2001 году как пользовательская модификация Half-Life. Получив множественные положительные отзывы[2], команда не стала останавливаться на достигнутом, чем и заслужила приглашение работать в Valve Software. В мае 2003 года свет увидела первая версия (1.0) DoD под авторством Valve, которую позже поправили (1.1), чтобы распространять через Steam. Сейчас Steam является обязательным для игры в Day of Defeat. 26 сентября 2005 года серия перешла на движок Half-Life 2 — Source Engine — с игрой Day of Defeat: Source. В самом первом релизе, тогда ещё, модификации (когда классы включали в себя только Силы поддержки (англ. Support Infantry), Сержанта (англ. Sergeant), Стрелка (англ. Rifleman) и Снайпера (англ. Sniper)) выбор класса влиял на скорость передвижения. Стрелки бегали быстрее всех, Силы поддержки были самым медленным классом. Сержант обладал усредненным значением скорости.",
      "url" :  "https://ru.wikipedia.org/wiki/Day_of_Defeat",
      "image" : "dod",
      "fullImage" : "dod_full"
    },
    {
      "title" : "Half Life 2",
      "releaseDate" : "2003",
      "shortDescription" : "Half-Life 2 (с англ. — «период полураспада») — компьютерная игра в жанре научно-фантастического шутера от первого лица, разработанная компанией Valve Software и изданная Sierra Studios 8 ноября 1998 года для персонального компьютера.",
      "fullDescription" : "Half-Life 2 (с англ. — «период полураспада») — компьютерная игра в жанре научно-фантастического шутера от первого лица, разработанная компанией Valve Software и изданная Sierra Studios 8 ноября 1998 года для персонального компьютера[3]. Первая игра в серии Half-Life. Технически игра основана на значительно переработанном движке Quake от id Software[7][8]. В 2001 году студия Gearbox Software портировала Half-Life на игровую приставку Sony PlayStation 2[5]. Также игра разрабатывалась для платформы Sega Dreamcast, но релиз был отменён[9][10]. В январе 2013 года Valve портировала игру на Linux и OS X[11][12]. Half-Life стала одной из первых игр, в которых сюжет развивается полностью внутри игрового пространства без использования видеозаставок. Игровые издания высоко оценили новаторский стиль повествования, являющийся главным достоинством игры[13][14]. Другой сильной стороной Half-Life называют искусственный интеллект противников[14][15]. Half-Life является одной из первых игр, где у игрока появились союзники. Многие издания отмечают, что Half-Life произвела революцию в жанре шутера от первого лица и положила начало новому этапу его развития[16][17]. Игра получила множество положительных отзывов от игровой прессы[18][19]. Более 50 игровых изданий признали Half-Life «Игрой года», а журнал PC Gamer трижды называл её «лучшей игрой из когда-либо созданных»[20]. На волне успеха игры были выпущены несколько дополнений: Half-Life: Opposing Force, Half-Life: Blue Shift и Half-Life: Decay. Кроме того, было создано много официальных модификаций, в том числе сетевых: Counter-Strike, Team Fortress Classic, Deathmatch Classic, Day of Defeat, Ricochet (англ.)русск.. В 2004 году было выпущено продолжение — Half-Life 2, также признанное «Игрой года» большинством изданий.",
      "url" :  "https://ru.wikipedia.org/wiki/Half-Life",
      "image" : "halflife",
      "fullImage" : "halflife_full"
    },
    {
      "title" : "Left 4 Dead",
      "releaseDate" : "2008",
      "shortDescription" : "Left 4 Dead — многопользовательская компьютерная игра в жанрах шутера от первого лица и survival horror, разработанная компанией Turtle Rock Studios, которая с 10 января 2008 по 3 июня 2009 являлась частью Valve Corporation. Игра создана на движке Source версии 14 для платформ Windows NT и Xbox 360. Портированием игры на Xbox 360 занималась студия Certain Affinity[4]. 28 октября 2010 года игра стала доступна на Mac OS X.",
      "fullDescription" : "Left 4 Dead[3] — многопользовательская компьютерная игра в жанрах шутера от первого лица и survival horror, разработанная компанией Turtle Rock Studios, которая с 10 января 2008 по 3 июня 2009 являлась частью Valve Corporation. Игра создана на движке Source версии 14 для платформ Windows NT и Xbox 360. Портированием игры на Xbox 360 занималась студия Certain Affinity[4]. 28 октября 2010 года игра стала доступна на Mac OS X. Впервые информация о Left 4 Dead появилась в рождественском номере журнала PC Gamer UK за 2006 год в виде шестистраничной статьи. А опробовать игру публика смогла на QuakeCon 2007 и Showdown 2007 LAN, прошедшей в американском городе Сан-Хосе.",
      "url" :  "https://ru.wikipedia.org/wiki/Left_4_Dead",
      "image" : "left4dead",
      "fullImage" : "left4dead_full"
    },
    {
      "title" : "Minecraft",
      "releaseDate" : "2011",
      "shortDescription" : "Minecraft (от англ. mine «шахта», «добывать» и англ. craft «ремесло») — компьютерная инди-игра в жанре песочницы с элементами симулятора выживания и открытым миром, разработанная шведским программистом Маркусом Перссоном, известным также как «Notch», и позже выпускаемая основанной Перссоном компанией Mojang. Портированием и поддержкой версий игры для игровых консолей занималась британская компания 4J Studios. В 2014 году компания Mojang и права на Minecraft были приобретены американской компанией Microsoft.",
      "fullDescription" : "Minecraft (от англ. mine «шахта», «добывать» и англ. craft «ремесло») — компьютерная инди-игра в жанре песочницы с элементами симулятора выживания и открытым миром, разработанная шведским программистом Маркусом Перссоном, известным также как «Notch», и позже выпускаемая основанной Перссоном компанией Mojang. Портированием и поддержкой версий игры для игровых консолей занималась британская компания 4J Studios. В 2014 году компания Mojang и права на Minecraft были приобретены американской компанией Microsoft. Игра написана на Java с использованием библиотеки LWJGL. Она была задумана как подражание игре Infiniminer, хотя Маркус Персон выражал желание уподобить её геймплей игре Dwarf Fortress. Первая публичная альфа-версия игры для ПК была выпущена в 2009 году; после постепенных дополнений в 2011 году Mojang выпустила полную версию игры. Minecraft доступна для Windows (Java Edition и Windows 10 Edition), Linux, OS X, Android, iOS, Windows Phone, PlayStation 3, PlayStation Vita, PlayStation 4, Xbox 360, Xbox One и Raspberry Pi. Версия игры для сенсорных устройств (телефонов и планшетов) носит название Minecraft: Pocket Edition.",
      "url" :  "https://ru.wikipedia.org/wiki/Minecraft",
      "image" : "minecraft",
      "fullImage" : "minecraft_full"
    },
    {
      "title" : "CS: Source",
      "releaseDate" : "2004",
      "shortDescription" : "Counter-Strike: Source (сокращается до CS: Source и CS:S) — компьютерная игра в жанре многопользовательского командного шутера от первого лица, разработанная компаниями Valve и Turtle Rock Studios; ремейк Counter-Strike, модификации 1999 года для игры Half-Life. Построенная на игровом движке Source, игра была выпущена в 2004 году изначально в комплекте с Half-Life 2, однако позже появились и отдельные её издания.",
      "fullDescription" : "Counter-Strike: Source (сокращается до CS: Source и CS:S) — компьютерная игра в жанре многопользовательского командного шутера от первого лица, разработанная компаниями Valve и Turtle Rock Studios; ремейк Counter-Strike, модификации 1999 года для игры Half-Life. Построенная на игровом движке Source, игра была выпущена в 2004 году изначально в комплекте с Half-Life 2, однако позже появились и отдельные её издания. Как и в оригинальной версии игры, в Counter-Strike: Source друг другу противостоят команда контр-террористов (CT, спецназа) и команда террористов (T) в серии раундов. Каждый раунд выигрывается посредством выполнения определённой миссии, такой как подрыв бомбы или спасение заложников, либо после уничтожения всех членов вражеской команды. Игровой процесс аналогичен таковому в Counter-Strike. Большинство видов оружия также идентично Counter-Strike за исключением щита, который был доступен только контр-террористам.",
      "url" :  "https://ru.wikipedia.org/wiki/Counter-Strike:_Source",
      "image" : "source",
      "fullImage" : "source_full"
    },
    {
      "title" : "Team Fortress 2",
      "releaseDate" : "2007",
      "shortDescription" : "Team Fortress 2 — компьютерная игра в жанре многопользовательского шутера от первого/третьего лица, разработанная и впервые изданная компанией Valve Corporation в 2007 году в составе сборника The Orange Box для Windows и Xbox 360; позднее в этом же году состоялся релиз игры в варианте для PlayStation 3; релиз самостоятельной версии игры для Windows состоялся в 2008 году. На территории СНГ игра издавалась компанией «Бука» в составе The Orange Box, а также в качестве независимого программного продукта (отдельный DVD-диск).",
      "fullDescription" : "Team Fortress 2 — компьютерная игра в жанре многопользовательского шутера от первого/третьего лица, разработанная и впервые изданная компанией Valve Corporation в 2007 году в составе сборника The Orange Box для Windows и Xbox 360; позднее в этом же году состоялся релиз игры в варианте для PlayStation 3; релиз самостоятельной версии игры для Windows состоялся в 2008 году. На территории СНГ игра издавалась компанией «Бука» в составе The Orange Box, а также в качестве независимого программного продукта (отдельный DVD-диск). Игра, служащая «сиквелом» к модификации Team Fortress под Quake и ремейку последней — модификации Team Fortress Classic под Half-Life, была анонсирована в 1998 году, причём концепция и дизайн проекта на протяжении последующих девяти лет, составивших время его разработки, существенно изменились. В 1999 году казалось, что геймплей игры отклонялся от идей предшествующих проектов в сторону большей реалистичности и милитаризма, но за девять лет работы над проектом концепция была изменена. Финальный вариант Team Fortress 2 очень близок к оригинальным модификациям Team Fortress и Team Fortress Classic, но резко отличается от них визуальной частью, исполненной в мультяшном карикатурном стиле с использованием лицевой анимации, основанной на творчестве таких художников начала двадцатого века как Дж. К. Лейендекер, Дин Корнуэлл и Норман Роквелл[6], следуя популярной тенденции недавних фильмов, в частности недавно созданных Pixar/Disney, к примеру, фильм «Суперсемейка».",
      "url" :  "https://ru.wikipedia.org/wiki/Team_Fortress_2",
      "image" : "tf2",
      "fullImage" : "tf2_full"
    }
  ]
}
